/******************************************************************
 *  参考URL   Todo
 ******************************************************************/

/*
    Vue.js公式サイト
    https://jp.vuejs.org/v2/guide/index.html

    【Vue.js 使い方】とりあえずこれだけ覚えておけばなんとかなりそう。
    http://one-way.tech/programing/basic-vue-js/


 */


/******************************************************************
 *  基本構文   Todo
 ******************************************************************/

/********************************
 *  条件分岐とループ
 ********************************/

/*
    <div id="app-3">
        <span v-if="seen">Now you see me</span>
    </div>
 */

var app3 = new Vue({
    el: '#app-3',
    data: {
        seen: true
    }
})