############################################################################
# LinuC レベル201 試験範囲 Todo
############################################################################

2.07：ネットワーククライアントの管理
    2.07.1	DHCPサーバーの設定と管理
    2.07.2	PAM認証
    2.07.3	LDAPクライアントの利用方法
    2.07.4	OpenLDAPサーバーの設定

2.08：ドメインネームサーバー
    2.08.1	BINDの設定と管理
    2.08.2	ゾーン情報の管理
    2.08.3	セキュアなDNSサーバーの実現

2.09：HTTPサーバーとプロキシサーバー
    2.09.1	Apache HTTPサーバーの設定と管理
    2.09.2	OpenSSLとHTTPSの設定
    2.09.3	nginxの設定と管理
    2.09.4	Squidの設定と管理

2.10：電子メールサービス
    2.10.1	Postfixの設定と管理
    2.10.2	Dovecotの設定と管理

2.11：ファイル共有サービス
    2.11.1	Sambaの設定と管理
    2.11.2	NFSサーバーの設定と管理

2.12：システムのセキュリティ
    2.12.1	iptables や firewalld によるパケットフィルタリング
    2.12.2	OpenSSH サーバーの設定と管理
    2.12.3	OpenVPNの設定と管理
    2.12.4	セキュリティ業務



############################################################################
# 2.07：ネットワーククライアントの管理 Todo
############################################################################

############################################################################
# 2.08：ドメインネームサーバー Todo
############################################################################


############################################################################
# 2.09：HTTPサーバーとプロキシサーバー Todo
############################################################################

##################################
# 2.09.1	Apache HTTPサーバーの設定と管理
##################################
<< COMMENTOUT



COMMENTOUT

##################################
# 2.09.2	OpenSSLとHTTPSの設定
##################################

##################################
# 2.09.3	nginxの設定と管理
##################################

##################################
# 2.09.4	Squidの設定と管理
##################################

